/*
标识符： 定义： java 对各种变量，方法，和类等要素命名时使用的字符序列称为标识符
        如类名，变量名，方法名，接口名，包名。。。
        规则（主要）：由26个英文字母大小写，0-9，_或 $组成
                    数字不可以开头
                    不可以使用关键字和保留字
                    严格区分大小写，长度无限制
                    不能包含空格

         规范：包名：多单词组成时所有字母都小写：xxxyyy
              类名、接口名：多单词组成时，所有单词的首字母大写：XxxYyyZzz
              变量名，方法名：多单词组成时，第一个单词首字母小写，第二个单词开始每个单子首字母大写
                            xxxYyyZzz
              常量名：所有字母都大写，多单词时每个单词用下划线链接:XXX_YYY_ZZZ

 */
public class IdentifierTest {
    public static void main(String[] args) {

    }
}
